function solution_Multisup_Shaft    %Функция интегрирования уравнений движения на заданном интервале времени и построения графиков
h=0.0005;    %Шаг
t=[0:h:10];    %Период интегрирования
%Начальные условия
q0 = [0.01;  0.00;  0.00;  0.00;   0.02;  0.00;  0.00;  0.00]'; % Смещение x2 = 1 см, x3 = 2 см
v0 = [0.00;  0.15;  0.00;  0.00;   0.00;  0.30;  0.00;  0.00]'; % Скорость V_y2 = 0.15 м/с, V_y3 = 0.30 м/с
y(:,1) = [q0 v0];
%Основной цикл решения 
i=1; 
for i=2:size(t,2)
y(1:16,i)=sredn_Multisup_Shaft(h,t(i-1),y(:,i-1));
end
%Графики координаты ц.м. верхнего импеллера
figure
plot(t,y(1,:),'k'); grid on;
legend('Импеллер 1: координата x (м. cр. точки)');
xlabel('t'); ylabel('x_C, м');
 
figure
plot(y(1,:),y(2,:),'k'); grid on;
legend('Импеллер 1: траектория ц.м. (м. cр. точки)');
xlabel('x, м'); ylabel('y, м');
 
figure
plot(y(5,:),y(6,:),'k'); grid on;
legend('Импеллер 2: траектория ц.м. (м. cр. точки)');
xlabel('x, м'); ylabel('y, м');
 
FFT_alg    %БП Фурье для поиска собственных частот