function y=sredn_Multisup_Shaft(h,t,x)     %Функция решения уравнений колебаний вала методом средней точки
Data_Multisup_Shaft
E=eye(8,8);

M=rho*S*l_e/420*[2*156+m1/(rho*S*l_e/420) 0 0 22*l_e 54 0 0 -13*l_e;
0 2*156+m1/(rho*S*l_e/420) -22*l_e 0 0 54 13*l_e 0;
0 -22*l_e 2*4*l_e^2+I_11/(rho*S*l_e/420) 0 0 -13*l_e -3*l_e^2 0;
22*l_e 0 0 2*4*l_e^2+I_11/(rho*S*l_e/420) 13*l_e 0 0 -3*l_e^2;
54 0 0 13*l_e 156+m2/(rho*S*l_e/420) 0 0 -22*l_e;
0 54 -13*l_e 0 0 156+m2/(rho*S*l_e/420) 22*l_e 0;
0 13*l_e -3*l_e^2 0 0 22*l_e 4*l_e^2+I_12/(rho*S*l_e/420) 0;
-13*l_e 0 0 -3*l_e^2 -22*l_e 0 0 4*l_e^2+I_12/(rho*S*l_e/420)];
K=EI/l_e^3*[2*12 0 0 0 -12 0 0 6*l_e;
    0 2*12 0 0 0 -12 -6*l_e 0;
    0 0 2*4*l_e^2 0 0 6*l_e 2*l_e^2 0;
    0 0 0 2*4*l_e^2 -6*l_e 0 0 2*l_e^2;
    -12 0 0 -6*l_e 12 0 0 -6*l_e;
    0 -12 6*l_e 0 0 12 6*l_e 0;
    0 -6*l_e 2*l_e^2 0 0 6*l_e 4*l_e^2 0;
    6*l_e 0 0 2*l_e^2 -6*l_e 0 0 4*l_e^2];
% Нахождение собственных значений (квадратов частот)
squares_p = eig(K, M);
% Извлечение корней и сортировка по возрастанию
p_values = sort(sqrt(squares_p));
% Две низшие (минимальные) круговые частоты вала (рад/с):
p1 = p_values(1);
p2 = p_values(3); % Индекс 3, так как частоты кратны из-за симметрии плоскостей X и Y
%Матрица коэффициентов гидродинамического демпфирования
alp=2*p1*p2*Psi/(p1+p2);
beta=2*Psi/(p1+p2);
B=alp*M+beta*K;
%Матрица гироскопических моментов
G=[0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0;
    0 0 0 -I_01*omega 0 0 0 0;
    0 0 I_01*omega 0 0 0 0 0;
    0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 -I_02*omega;
    0 0 0 0 0 0 I_02*omega 0];

A=[zeros(8,8) E;-M^(-1)*K -M^(-1)*(B+G)];
y=((eye(16,16)-0.5*h*A)^(-1))*((eye(16,16)+0.5*h*A)*x);    %Поиск решения методом средней точки