function solution_HTGR    %Функция интегрирования уравнений движения на заданном интервале времени и построения графиков
Data_HTGR
h=0.0002;    %Шаг
t=[0:h:5];    %Период интегрирования
%Начальные условия
q0 = [0.0;  0.00;  0.00;  0.00;   0.0;  0.00;  0.00;  0.00]'; % начальное смещение
v0 = [0.00;  0;  0.00;  0.00;   0.00;  0.0;  0.00;  0.15]'; % нач. скорость
y(:,1) = [q0 v0];
[A,M]=freq_HTGR();
%Основной цикл решения 
i=1; 
for i=2:size(t,2)
    y(1:16,i)=((eye(16,16)-0.5*h*A)^(-1))*((eye(16,16)+0.5*h*A)*y(:,i-1))+(eye(16,16)-0.5*h*A)^(-1)*h*[zeros(8,1); M^(-1)*[0 0 0 -Fa 0 0 0 0]'*sin(omega_p*(t(i-1)+h/2))];    %Поиск решения методом средней точки
end
%Графики координат узла 3
figure
plot(t,y(5,:),'k'); grid on;
legend('Узел 3 трубопровода: координата x (м. cр. точки)');
xlabel('t'); ylabel('x, м');
 
figure
plot(y(5,:),y(6,:),'k'); grid on;
legend('Траектория колебаний узла 3 (м. cр. точки)');
xlabel('x, м'); ylabel('y, м'); 